In [16]:
import pandas as pd

In [17]:
df = pd.read_csv('employee_data.csv')
print("The Data set has {} rows and {} columns".format(df.shape[0], df.shape[1]))
display(df.describe())
display(df.head())
display(df.dtypes.value_counts())

The Data set has 1001 rows and 14 columns

               Age  Annual Salary      Bonus %
count  1001.000000    1001.000000  1001.000000
mean     44.458541  109290.779221     0.079680
std      11.223838   53715.564559     0.118347
min      25.000000   40352.000000     0.000000
25%      35.000000   70340.000000     0.000000
50%      45.000000   91835.000000     0.000000
75%      54.000000  138215.000000     0.120000
max      65.000000  258734.000000     0.400000

,Employee ID,Full Name,Job Title,Department,Business Unit,Gender,Ethnicity,Age,Hire Date,Annual Salary,Bonus %,Country,City,Exit Date
0,E02002,Kai Le,Controls Engineer,Engineering,Manufacturing,Male,Asian,47,2022-02-05,92368,0.00,United States,Columbus,NaN
1,E02003,Robert Patel,Analyst,Sales,Corporate,Male,Asian,58,2013-10-23,45703,0.00,United States,Chicago,NaN
2,E02004,Cameron Lo,Network Administrator,IT,Research & Development,Male,Asian,34,2019-03-24,83576,0.00,China,Shanghai,NaN
3,E02005,Harper Castillo,IT Systems Architect,IT,Corporate,Female,Latino,39,2018-04-07,98062,0.00,United States,Seattle,NaN
4,E02006,Harper Dominguez,Director,Engineering,Corporate,Female,Latino,42,2005-06-18,175391,0.24,United States,Austin,NaN

object     11
int64       2
float64     1
Name: count, dtype: int64

In [18]:
num_vars = df.columns[df.dtypes != 'object']
cat_vars = df.columns[df.dtypes == 'object']

print(num_vars)
print(cat_vars)

Index(['Age', 'Annual Salary', 'Bonus %'], dtype='object')
Index(['Employee ID', 'Full Name', 'Job Title', 'Department', 'Business Unit',
       'Gender', 'Ethnicity', 'Hire Date', 'Country', 'City', 'Exit Date'],
      dtype='object')

In [23]:
df[num_vars].isnull().sum().sort_values(ascending=False)/len(df)

Age              0.0
Annual Salary    0.0
Bonus %          0.0
dtype: float64

In [25]:
df[cat_vars].isnull().sum().sort_values(ascending=False)/len(df)

Exit Date        0.897103
Employee ID      0.000000
Full Name        0.000000
Job Title        0.000000
Department       0.000000
Business Unit    0.000000
Gender           0.000000
Ethnicity        0.000000
Hire Date        0.000000
Country          0.000000
City             0.000000
dtype: float64

In [41]:
list1 = ["Job Title", "Department", "Business Unit", "Gender", "Ethnicity", "Country", "City"]
for column in list1:
    unique = df[column].unique()
    print(f"Unique values in {column}: {unique}")

Unique values in Job Title: ['Controls Engineer' 'Analyst' 'Network Administrator'
 'IT Systems Architect' 'Director' 'Sr. Analyst' 'Analyst II'
 'System Administrator\xa0' 'Manager' 'Systems Analyst' 'Sr. Manager'
 'Vice President' 'Service Desk Analyst' 'Technical Architect'
 'Account Representative' 'Business Partner' 'Test Engineer'
 'IT Coordinator' 'Cloud Infrastructure Architect' 'Enterprise Architect'
 'Computer Systems Manager' 'Automation Engineer' 'Solutions Architect'
 'Sr. Business Partner' 'HRIS Analyst' 'Engineering Manager'
 'Field Engineer' 'Network Engineer' 'Network Architect'
 'Sr. Account Representative' 'Development Engineer' 'Quality Engineer'
 'Operations Engineer']
Unique values in Department: ['Engineering' 'Sales' 'IT' 'Accounting' 'Finance' 'Marketing'
 'Human Resources']
Unique values in Business Unit: ['Manufacturing' 'Corporate' 'Research & Development' 'Specialty Products']
Unique values in Gender: ['Male' 'Female' 'Femae']
Unique values in Ethnicity: ['Asian' 'Latino' 'Caucasian' 'Black']
Unique values in Country: ['United States' 'China' 'Brazil']
Unique values in City: ['Columbus' 'Chicago' 'Shanghai' 'Seattle' 'Austin' 'Phoenix' 'Chongqing'
 'Chengdu' 'Miami' 'Beijing' 'Rio de Janeiro' 'Sao Paulo' 'Manaus']